# Напишите программу, которая строит случайную перестановку чисел от 1 до N – массив из N натуральных чисел, в котором есть все числа от 1 до N .
# При этом первым числом в перестановке обязательно должно быть число 5.
# Входные данные
# Входная строка содержит размер массива N . Гарантируется, что 0 < N ≤ 10000 .
# Выходные данные
# Программа должна вывести в одну строку элементы полученного случайного массива, разделив их пробелами.
# В массиве должны присутствовать все натуральные числа от 1 до N , причём первым числом в перестановке обязательно должно быть число 5.
# Примеры
# входные данные
# 10
# выходные данные
# 5 6 4 2 1 10 8 9 7 3
