# Среднее по группам
# Напишите программу, которая заполняет массив из N элементов случайными целыми числами в диапазоне [ A , B ]
# и определяет среднее арифметическое всех элементов этого массива, которые меньше 50, и среднее арифметическое всех остальных элементов.
# Входные данные
# Входная строка содержит три числа: границы диапазона случайных чисел A и B , а также размер массива N . Все числа разделены пробелами.
# Гарантируется, что 0 < N ≤ 10000 .
# Выходные данные
# В первой строке программа должна вывести N элементов построенного массива, разделив их пробелами,
# а во второй строке – среднее арифметическое всех элементов этого массива, которые меньше 50, и затем через пробел
# среднее арифметическое всех остальных элементов. При выводе последних двух чисел нужно сохранить три знака в дробной части.
# Если в какой-то из двух групп не оказалось ни одного элемента, нужно вывести вместо среднего арифметического число 0.
