'''Напишите программу для печати всех уникальных значений в словаре. 
Input:  [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}] 
Output: {'S005', 'S002', 'S007', 'S001', 'S009'}'''
# Для удаления пробелов и символов переноса строки
# a = " s005 "
# print(a.strip()) # s005

list_1 = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VI": "S004"}, {
    "VII": " S005 "}, {" V ": " S009 "}, {" VIII ": " S007 "}]
list_2 = set()
for i in list_1:
    for keys, values in i.items():
        list_2.add(values.strip())
print(list_2)
